app/Validation/Userrules.php

    public function validateUser(string $str, string $fields, array $data) {
        $model = new UsuarioModel();
        $user = $model->where('email', $data['email'])->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'edp@mail.com'
 LIMIT 1