app/Controllers/Admin/EvaluacionController.php

    public function mostrarFormulario()
    {
        $asignaturaModel = new AsignaturaModel();
        $preguntaModel = new PreguntaModel();
        $profesorModel = new ProfesorModel();

        $data['asignaturas'] = $asignaturaModel->findAll();
        $data['preguntas'] = $preguntaModel->findAll();
        $data['profesores'] = $profesorModel->findAll();
---
SELECT *
FROM `asignaturas`
SELECT *
FROM `preguntas`
SELECT *
FROM `profesores`

    public function enviar()
    {

        $this->session = \Config\Services::session();

        $periodo = $this->request->getPost('periodo');
        $asignaturaId = $this->request->getPost('asignatura');
        $profesorId = $this->request->getPost('profesor');
        $respuestas = [];

        // Recoge las respuestas de las preguntas
        foreach ($this->request->getPost() as $key => $value) {
            if (strpos($key, 'pregunta') !== false) {
                $respuestas[$key] = $value;
            }
        }

        $comentario = $this->request->getPost('comentario');

        // Guardar en la base de datos
        $evaluacionModel = new EvaluacionModel();
        $evaluacionModel->save([
            'periodo' => $periodo,
            'evaluador' => $this->session->id,
            'asignatura_id' => $asignaturaId,
            'profesor_id' => $profesorId,
            'respuestas' => json_encode($respuestas),
            'comentario' => $comentario,
            'codigo_referencia' => uniqid()
        ]);
---
INSERT INTO `evaluacion` (`periodo`, `evaluador`, `asignatura_id`, `profesor_id`, `respuestas`, `comentario`, `codigo_referencia`) VALUES ('1', '5461', '4', '1', '{\"pregunta1\":\"1\",\"pregunta2\":\"2\",\"pregunta5\":\"3\",\"pregunta46\":\"5\"}', 'sin comentarios', '657ccbbce127a')

    public function average($profesorId)
    {
        // Create an instance of the EvaluacionModel and ProfesorModel
        $evaluacionModel = new EvaluacionModel();
        $profesorModel = new ProfesorModel();
        $preguntaModel = new PreguntaModel();
        $dimensionModel = new DimensionModel();

        // Retrieve the professor's name
        $professorName = $profesorModel->find($profesorId)['nombre'];
        $preguntas = $preguntaModel->findAll();
        $dimensiones = $dimensionModel->findAll();

        // Retrieve evaluations for the specific professor
        $evaluations = $evaluacionModel
            ->where('profesor_id', $profesorId)
            ->findAll();
---
SELECT *
FROM `preguntas`
SELECT *
FROM `evaluacion`
WHERE `profesor_id` = '68'
AND `created_at` > '2023-11-01'