app/Controllers/Admin/ProfesorController.php

SELECT `p`.*, `a`.`nombre` as `nombreArea`
FROM `profesores` as `p`
JOIN `areas` as `a` ON `p`.`area` = `a`.`id`
---
    public function index()
    {
        $db = \Config\Database::connect();

        $builder = $this->db->table('profesores as p');
        $builder->select('p.*, a.nombre as nombreArea');
        $builder->join('areas as a', 'p.area = a.id');
        $profesores = $builder->get()->getResult();