app/Controllers/Admin/UsuarioController.php

    public function index()
    {
        $usuarios = $this->usuario->orderBy('id', 'desc')->findAll(50);
---
SELECT *
FROM `usuarios`
ORDER BY `id` DESC
 LIMIT 50

    public function create()
    {
        $usuario = new UsuarioModel();

        $data = [
            'rol'       => $this->request->getVar('rol'),
            'codigo'    => $this->request->getVar('codigo'),
            'nombre'    => $this->request->getVar('nombre'),
            'apaterno'  => $this->request->getVar('apaterno'),
            'amaterno'  => $this->request->getVar('amaterno'),
            'email'     => $this->request->getVar('email'),
            'password'  => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
            'foto'      => $this->request->getVar('foto'),
            'sexo'      => $this->request->getVar('sexo'),
            'bio'       => $this->request->getVar('bio')
        ];

        $rules = [
            // 'codigo'    => 'required|is_unique[usuarios.codigo]',
            'email'     => 'required|valid_email|is_unique[usuarios.email]'
        ];

        if ($this->validate($rules)) {
            $usuario->insert($data);
---
INSERT INTO `usuarios` (`rol`, `codigo`, `nombre`, `apaterno`, `amaterno`, `email`, `password`, `foto`, `sexo`, `bio`, `created_at`, `updated_at`) VALUES ('estudiante', '2024001', 'usuario estudiante de prueba', NULL, NULL, 'edp@mail.com', '$2y$10$Nznx9qM4Ii9VNGxTwCTtueIZ4gKwGyqSuJkJDDn6DbIB3NV3MhCrS', '', 'Hombre', '', '2023-12-15 15:56:09', '2023-12-15 15:56:09')