app/Controllers/UserController.php

    public function login()
    {
        $data = [];

        if ($this->request->getMethod() == 'post') {

            $rules = [
                'email' => 'required|min_length[6]|max_length[50]|valid_email',
                'password' => 'required|min_length[8]|max_length[255]|validateUser[email,password]',
            ];

            $errors = [
                'password' => [
                    'validateUser' => "Correo electrónico o contraseña incorrecta",
                ],
            ];

            if (!$this->validate($rules, $errors)) {

                return view('login', [
                    "validation" => $this->validator,
                ]);

            } else {
                $model = new UsuarioModel();

                $user = $model->where('email', $this->request->getVar('email'))->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'edp@mail.com'
 LIMIT 1